Конфигурация/src/InformationRegisters/НастройкиДоступаAPI/НастройкиДоступаAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиДоступаAPI</name>
  <attributes>
    <name>ТокенДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьЧтение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.ВнешниеСистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/InformationRegisters/ИсторияВызововAPI/ИсторияВызововAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияВызововAPI</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.ВнешниеСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МетодAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторВызова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Enums/СтатусыСтудента/СтатусыСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСтудента</name>
  <enumValues>
    <name>Обучается</name>
  </enumValues>
  <enumValues>
    <name>Отчислен</name>
  </enumValues>
  <enumValues>
    <name>Выпускник</name>
  </enumValues>
  <enumValues>
    <name>АкадемическийОтпуск</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Enums/ВидыПосещения/ВидыПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПосещения</name>
  <enumValues>
    <name>Присутствовал</name>
  </enumValues>
  <enumValues>
    <name>Отсутствовал</name>
  </enumValues>
  <enumValues>
    <name>Опоздал</name>
  </enumValues>
  <enumValues>
    <name>УважительнаяПричина</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/ПосещениеЗанятия/ПосещениеЗанятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеЗанятия</name>
  <registerRecords>AccumulationRegister.ПосещаемостьСтудентов</registerRecords>
  <registerRecords>AccumulationRegister.УспеваемостьСтудентов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Занятие</name>
    <type>
      <types>DocumentRef.Занятие</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Посещаемость</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПосещения</name>
      <type>
        <types>EnumRef.ВидыПосещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтсутствия</name>
      <type>
        <types>CatalogRef.ПричиныОтсутствия</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ВедомостьОценок/ВедомостьОценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОценок</name>
  <registerRecords>AccumulationRegister.УспеваемостьСтудентов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОценки</name>
    <type>
      <types>EnumRef.ВидыОценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Оценки</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценкаТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/Занятие/Занятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Занятие</name>
  <registerRecords>AccumulationRegister.УчебнаяНагрузкаПреподавателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятия</name>
    <type>
      <types>CatalogRef.ВидыЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состоялось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/Documents/ФормированиеРасписания/ФормированиеРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеРасписания</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Занятия</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятия</name>
      <type>
        <types>CatalogRef.ВидыЗанятий</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Преподаватели</types>
      </type>
    </attributes>
    <attributes>
      <name>Аудитория</name>
      <type>
        <types>CatalogRef.Аудитории</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/НазначениеПреподавателя/НазначениеПреподавателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеПреподавателя</name>
  <registerRecords>InformationRegister.ЗакреплениеДисциплинЗаПреподавателями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Преподаватели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятия</name>
      <type>
        <types>CatalogRef.ВидыЗанятий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/КорректировкаУчебногоПлана/КорректировкаУчебногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаУчебногоПлана</name>
  <registerRecords>InformationRegister.ПараметрыУчебногоПлана</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПлан</name>
    <type>
      <types>CatalogRef.УчебныеПланы</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Дисциплины</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗачетныеЕдиницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОценки</name>
      <type>
        <types>EnumRef.ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/CommonModules/ЗагрузкаТестовыхДанныхСервер/Module.bsl
Процедура ЗаполнитьВсеДанные() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Макет = Обработки.ЗагрузкаТестовыхДанных.ПолучитьМакет("МакетТестовыхДанных");

	ЗагрузитьОрганизацииИзМакета(Макет);
	ЗагрузитьФормыОбученияИзМакета(Макет);
	ЗагрузитьВидыЗанятийИзМакета(Макет);
	ЗагрузитьПричиныОтсутствияИзМакета(Макет);
	ЗагрузитьУчебныеПериодыИзМакета(Макет);
	ЗагрузитьНаправленияПодготовкиИзМакета(Макет);
	ЗагрузитьПодразделенияИзМакета(Макет);
	ЗагрузитьКафедрыИзМакета(Макет);
	ЗагрузитьУчебныеГруппыИзМакета(Макет);
	ЗагрузитьУчебныеПланыИзМакета(Макет);
	ЗагрузитьПреподавателейИзМакета(Макет);
	ЗагрузитьДисциплиныИзМакета(Макет);
	ЗагрузитьАудиторииИзМакета(Макет);
	ЗагрузитьСтудентовИзМакета(Макет);
	ЗагрузитьВнешниеСистемыИзМакета(Макет);
	СоздатьНастройкиДоступаAPI();
	
	ЗагрузитьДокументыИзМакета(Макет);

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ПолучитьСтрокиРазделаМакета(Макет, ИмяРаздела)

	Результат = Новый Массив;

	МаркерНачала = "#" + ИмяРаздела;
	МаркерКонца = "#Конец";

	НомерНачала = 0;
	НомерКонца = 0;

	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		ЗначениеЯчейки = СокрЛП(Строка(Макет.Область(НомерСтроки, 1).Текст));
		
		Если ЗначениеЯчейки = МаркерНачала Тогда
			
			НомерНачала = НомерСтроки;
			
			Для НомерСтрокиКонца = НомерСтроки + 1 По Макет.ВысотаТаблицы Цикл
				
				ЗначениеЯчейкиКонца = СокрЛП(Строка(Макет.Область(НомерСтрокиКонца, 1).Текст));
				
				Если ЗначениеЯчейкиКонца = МаркерКонца Тогда
					НомерКонца = НомерСтрокиКонца;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

	Если НомерНачала = 0 Или НомерКонца = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	СтрокаЗаголовков = НомерНачала + 1;
	Заголовки = Новый Массив;

	Для НомерКолонки = 1 По Макет.ШиринаТаблицы Цикл
		
		ИмяКолонки = СокрЛП(Строка(Макет.Область(СтрокаЗаголовков, НомерКолонки).Текст));
		
		Если ПустаяСтрока(ИмяКолонки) Тогда
			Прервать;
		КонецЕсли;
		
		Заголовки.Добавить(ИмяКолонки);
		
	КонецЦикла;

	Для НомерСтроки = НомерНачала + 2 По НомерКонца - 1 Цикл
		
		ДанныеСтроки = Новый Структура;
		ЕстьДанные = Ложь;

		Для ИндексКолонки = 0 По Заголовки.Количество() - 1 Цикл
			
			НомерКолонки = ИндексКолонки + 1;
			ИмяКолонки = Заголовки[ИндексКолонки];
			ЗначениеЯчейки = СокрЛП(Строка(Макет.Область(НомерСтроки, НомерКолонки).Текст));
			
			Если НЕ ПустаяСтрока(ЗначениеЯчейки) Тогда
				ЕстьДанные = Истина;
			КонецЕсли;
			
			ДанныеСтроки.Вставить(ИмяКолонки, ЗначениеЯчейки);
			
		КонецЦикла;

		Если ЕстьДанные Тогда
			Результат.Добавить(ДанныеСтроки);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СтрокаВБулево(ЗначениеСтрокой)

	ЗначениеСтрокой = ВРег(СокрЛП(Строка(ЗначениеСтрокой)));

	Возврат ЗначениеСтрокой = "ИСТИНА"
		Или ЗначениеСтрокой = "ДА"
		Или ЗначениеСтрокой = "1"
		Или ЗначениеСтрокой = "TRUE";

КонецФункции

Функция СтрокаВЧисло(ЗначениеСтрокой)

	ЗначениеСтрокой = СокрЛП(Строка(ЗначениеСтрокой));

	Если ПустаяСтрока(ЗначениеСтрокой) Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Число(СтрЗаменить(ЗначениеСтрокой, ".", ","));

КонецФункции

Функция СтрокаВДату(ЗначениеСтрокой)

	ЗначениеСтрокой = СокрЛП(Строка(ЗначениеСтрокой));

	Если ПустаяСтрока(ЗначениеСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Ожидаемый формат даты в макете: ДД.ММ.ГГГГ
	Если СтрДлина(ЗначениеСтрокой) < 10 Тогда
		Возврат Неопределено;
	КонецЕсли;

	День = Число(Лев(ЗначениеСтрокой, 2));
	Месяц = Число(Сред(ЗначениеСтрокой, 4, 2));
	Год = Число(Прав(ЗначениеСтрокой, 4));

	Возврат Дата(Год, Месяц, День);

КонецФункции

Функция НайтиСправочникПоНаименованию(МенеджерСправочника, Наименование)

	Наименование = СокрЛП(Строка(Наименование));

	Если ПустаяСтрока(Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ссылка = МенеджерСправочника.НайтиПоНаименованию(Наименование);

	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Процедура ЗагрузитьОрганизацииИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Организации");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.Организации.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.Организации.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.ПолноеНаименование = Данные.ПолноеНаименование;
		Элемент.ИНН = Данные.ИНН;
		Элемент.КПП = Данные.КПП;
		Элемент.ЮридическийАдрес = Данные.ЮридическийАдрес;
		Элемент.Телефон = Данные.Телефон;
		Элемент.Email = Данные.Email;
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьФормыОбученияИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ФормыОбучения");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.ФормыОбучения.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.ФормыОбучения.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.Описание = Данные.Описание;
		Элемент.Используется = СтрокаВБулево(Данные.Используется);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьВидыЗанятийИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ВидыЗанятий");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.ВидыЗанятий.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.ВидыЗанятий.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.Сокращение = Данные.Сокращение;
		Элемент.УчитыватьВНагрузке = СтрокаВБулево(Данные.УчитыватьВНагрузке);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьПричиныОтсутствияИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ПричиныОтсутствия");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.ПричиныОтсутствия.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.ПричиныОтсутствия.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.Уважительная = СтрокаВБулево(Данные.Уважительная);
		Элемент.ТребуетДокумент = СтрокаВБулево(Данные.ТребуетДокумент);
		Элемент.Описание = Данные.Описание;
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьУчебныеПериодыИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "УчебныеПериоды");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.УчебныеПериоды.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.УчебныеПериоды.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.ДатаНачала = СтрокаВДату(Данные.ДатаНачала);
		Элемент.ДатаОкончания = СтрокаВДату(Данные.ДатаОкончания);
		Элемент.НомерСеместра = СтрокаВЧисло(Данные.НомерСеместра);
		Элемент.Текущий = СтрокаВБулево(Данные.Текущий);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьНаправленияПодготовкиИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "НаправленияПодготовки");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.НаправленияПодготовки.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.НаправленияПодготовки.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.КодНаправления = Данные.КодНаправления;
		Элемент.Профиль = Данные.Профиль;
		Элемент.УровеньОбразования = Данные.УровеньОбразования;
		Элемент.СрокОбучения = СтрокаВЧисло(Данные.СрокОбучения);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьПодразделенияИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Подразделения");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.Подразделения.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Организация = НайтиСправочникПоНаименованию(Справочники.Организации, Данные.Организация);

		Элемент = Справочники.Подразделения.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Элемент.Организация = Организация;
		КонецЕсли;
		
		Элемент.Руководитель = Данные.Руководитель;
		Элемент.Телефон = Данные.Телефон;
		Элемент.Email = Данные.Email;
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьКафедрыИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Кафедры");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.Кафедры.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Подразделение = НайтиСправочникПоНаименованию(Справочники.Подразделения, Данные.Подразделение);

		Элемент = Справочники.Кафедры.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Элемент.Подразделение = Подразделение;
		КонецЕсли;
		
		Элемент.Заведующий = Данные.Заведующий;
		Элемент.Телефон = Данные.Телефон;
		Элемент.Email = Данные.Email;
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьУчебныеГруппыИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "УчебныеГруппы");

	СоответствиеОрганизаций = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Организации);
	СоответствиеПодразделений = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Подразделения);
	СоответствиеНаправлений = ПолучитьСоответствиеНаправленийПодготовки();
	СоответствиеФормОбучения = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.ФормыОбучения);
	СоответствиеУчебныхГрупп = ПолучитьСоответствиеУчебныхГрупп();

	Для Каждого Данные Из Строки Цикл
		
		КлючГруппы = НормализоватьКлюч(Данные.Наименование);
		СсылкаГруппы = СоответствиеУчебныхГрупп.Получить(КлючГруппы);

		Если СсылкаГруппы <> Неопределено Тогда
			Элемент = СсылкаГруппы.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.УчебныеГруппы.СоздатьЭлемент();
			Элемент.Наименование = Данные.Наименование;
		КонецЕсли;

		Родитель = ПолучитьИлиСоздатьГруппуУчебныхГрупп(Данные.Родитель, СоответствиеУчебныхГрупп);
		Организация = ПолучитьИзСоответствия(СоответствиеОрганизаций, Данные.Организация);
		Подразделение = ПолучитьИзСоответствия(СоответствиеПодразделений, Данные.Подразделение);
		Направление = ПолучитьИзСоответствия(СоответствиеНаправлений, Данные.НаправлениеПодготовки);
		ФормаОбучения = ПолучитьИзСоответствия(СоответствиеФормОбучения, Данные.ФормаОбучения);

		Если ЗначениеЗаполнено(Родитель) Тогда
			Элемент.Родитель = Родитель;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Элемент.Организация = Организация;
		Иначе
			Сообщить("Не найдена организация для группы " + Данные.Наименование + ": " + Данные.Организация);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Элемент.Подразделение = Подразделение;
		Иначе
			Сообщить("Не найдено подразделение для группы " + Данные.Наименование + ": " + Данные.Подразделение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Направление) Тогда
			Элемент.НаправлениеПодготовки = Направление;
		Иначе
			Сообщить("Не найдено направление подготовки для группы " + Данные.Наименование + ": " + Данные.НаправлениеПодготовки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ФормаОбучения) Тогда
			Элемент.ФормаОбучения = ФормаОбучения;
		Иначе
			Сообщить("Не найдена форма обучения для группы " + Данные.Наименование + ": " + Данные.ФормаОбучения);
		КонецЕсли;
		
		Элемент.Курс = СтрокаВЧисло(Данные.Курс);
		Элемент.ГодПоступления = СтрокаВЧисло(Данные.ГодПоступления);
		Элемент.Активна = СтрокаВБулево(Данные.Активна);
		
		Элемент.Записать();

		Если СсылкаГруппы = Неопределено Тогда
			СоответствиеУчебныхГрупп.Вставить(КлючГруппы, Элемент.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьУчебныеПланыИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "УчебныеПланы");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.УчебныеПланы.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Направление = НайтиСправочникПоНаименованию(Справочники.НаправленияПодготовки, Данные.НаправлениеПодготовки);
		УчебныйПериод = НайтиСправочникПоНаименованию(Справочники.УчебныеПериоды, Данные.УчебныйПериод);

		Элемент = Справочники.УчебныеПланы.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		
		Если ЗначениеЗаполнено(Направление) Тогда
			Элемент.НаправлениеПодготовки = Направление;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(УчебныйПериод) Тогда
			Элемент.УчебныйПериод = УчебныйПериод;
		КонецЕсли;
		
		Элемент.ГодУтверждения = СтрокаВЧисло(Данные.ГодУтверждения);
		Элемент.ДатаУтверждения = СтрокаВДату(Данные.ДатаУтверждения);
		Элемент.Активен = СтрокаВБулево(Данные.Активен);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьПреподавателейИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Преподаватели");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.Преподаватели.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Кафедра = НайтиСправочникПоНаименованию(Справочники.Кафедры, Данные.Кафедра);

		Элемент = Справочники.Преподаватели.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.Фамилия = Данные.Фамилия;
		Элемент.ИмяПреподавателя = Данные.ИмяПреподавателя;
		Элемент.Отчество = Данные.Отчество;
		
		Если ЗначениеЗаполнено(Кафедра) Тогда
			Элемент.Кафедра = Кафедра;
		КонецЕсли;
		
		Элемент.Должность = Данные.Должность;
		Элемент.УченаяСтепень = Данные.УченаяСтепень;
		Элемент.Телефон = Данные.Телефон;
		Элемент.Email = Данные.Email;
		Элемент.Работает = СтрокаВБулево(Данные.Работает);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьДисциплиныИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Дисциплины");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.Дисциплины.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Кафедра = НайтиСправочникПоНаименованию(Справочники.Кафедры, Данные.Кафедра);

		Элемент = Справочники.Дисциплины.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		
		Если ЗначениеЗаполнено(Кафедра) Тогда
			Элемент.Кафедра = Кафедра;
		КонецЕсли;
		
		Элемент.КодДисциплины = Данные.КодДисциплины;
		Элемент.КоличествоЧасов = СтрокаВЧисло(Данные.КоличествоЧасов);
		Элемент.ЗачетныеЕдиницы = СтрокаВЧисло(Данные.ЗачетныеЕдиницы);
		Элемент.Активна = СтрокаВБулево(Данные.Активна);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьАудиторииИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Аудитории");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.Аудитории.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.Аудитории.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.Корпус = Данные.Корпус;
		Элемент.Этаж = СтрокаВЧисло(Данные.Этаж);
		Элемент.Вместимость = СтрокаВЧисло(Данные.Вместимость);
		Элемент.ТипАудитории = Данные.ТипАудитории;
		Элемент.ЕстьПроектор = СтрокаВБулево(Данные.ЕстьПроектор);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьСтудентовИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Студенты");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.Студенты.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		УчебнаяГруппа = НайтиСправочникПоНаименованию(Справочники.УчебныеГруппы, Данные.УчебнаяГруппа);
		ФормаОбучения = НайтиСправочникПоНаименованию(Справочники.ФормыОбучения, Данные.ФормаОбучения);

		Элемент = Справочники.Студенты.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.Фамилия = Данные.Фамилия;
		Элемент.ИмяСтудента = Данные.ИмяСтудента;
		Элемент.Отчество = Данные.Отчество;
		Элемент.ДатаРождения = СтрокаВДату(Данные.ДатаРождения);
		
		Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
			Элемент.УчебнаяГруппа = УчебнаяГруппа;
		КонецЕсли;
		
		Элемент.НомерЗачетнойКнижки = Данные.НомерЗачетнойКнижки;
		Элемент.Телефон = Данные.Телефон;
		Элемент.Email = Данные.Email;
		Элемент.Статус = ПолучитьСтатусСтудента(Данные.Статус);
		
		Если ЗначениеЗаполнено(ФормаОбучения) Тогда
			Элемент.ФормаОбучения = ФормаОбучения;
		КонецЕсли;
		
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСтатусСтудента(СтатусСтрокой)

	СтатусСтрокой = СокрЛП(Строка(СтатусСтрокой));

	Если СтатусСтрокой = "АкадемическийОтпуск" Или СтатусСтрокой = "Академический отпуск" Тогда
		Возврат Перечисления.СтатусыСтудента.АкадемическийОтпуск;
	КонецЕсли;

	Если СтатусСтрокой = "Отчислен" Тогда
		Возврат Перечисления.СтатусыСтудента.Отчислен;
	КонецЕсли;

	Если СтатусСтрокой = "Выпускник" Тогда
		Возврат Перечисления.СтатусыСтудента.Выпускник;
	КонецЕсли;

	Возврат Перечисления.СтатусыСтудента.Обучается;

КонецФункции

Процедура ЗагрузитьВнешниеСистемыИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ВнешниеСистемы");

	Для Каждого Данные Из Строки Цикл
		
		Если ЗначениеЗаполнено(Справочники.ВнешниеСистемы.НайтиПоНаименованию(Данные.Наименование)) Тогда
			Продолжить;
		КонецЕсли;

		Элемент = Справочники.ВнешниеСистемы.СоздатьЭлемент();
		Элемент.Наименование = Данные.Наименование;
		Элемент.ИдентификаторСистемы = Данные.ИдентификаторСистемы;
		Элемент.АдресСистемы = Данные.АдресСистемы;
		Элемент.Активна = СтрокаВБулево(Данные.Активна);
		Элемент.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура СоздатьНастройкиДоступаAPI()

	Выборка = Справочники.ВнешниеСистемы.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.НастройкиДоступаAPI.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВнешняяСистема.Установить(Выборка.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		Запись.ВнешняяСистема = Выборка.Ссылка;
		Запись.ТокенДоступа = "token-" + Строка(Выборка.Код) + "-2026";
		Запись.РазрешитьЧтение = Истина;
		Запись.РазрешитьЗапись = Ложь;
		Запись.Активна = Истина;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ОчиститьВсеТестовыеДанные() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОчиститьДокументы();
	ОчиститьРегистрыСведений();
	ОчиститьСправочники();

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ОчиститьДокументы()

	УдалитьДокументыМенеджера(Документы.ПосещениеЗанятия);
	УдалитьДокументыМенеджера(Документы.ВедомостьОценок);
	УдалитьДокументыМенеджера(Документы.Занятие);
	УдалитьДокументыМенеджера(Документы.ФормированиеРасписания);
	УдалитьДокументыМенеджера(Документы.НазначениеПреподавателя);
	УдалитьДокументыМенеджера(Документы.КорректировкаУчебногоПлана);
	УдалитьДокументыМенеджера(Документы.ОбращениеСтудента);
	УдалитьДокументыМенеджера(Документы.ПриказОбОтчислении);
	УдалитьДокументыМенеджера(Документы.ПриказОПереводе);
	УдалитьДокументыМенеджера(Документы.ПриказОЗачислении);

КонецПроцедуры

Процедура УдалитьДокументыМенеджера(МенеджерДокумента)

	Выборка = МенеджерДокумента.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Попытка
			Объект = Выборка.ПолучитьОбъект();
			Объект.Удалить();
		Исключение
			Сообщить("Не удалось удалить документ: " + Строка(Выборка.Ссылка) + ". " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОчиститьРегистрыСведений()

	ОчиститьНезависимыйРегистрСведений(РегистрыСведений.НастройкиДоступаAPI);
	ОчиститьНезависимыйРегистрСведений(РегистрыСведений.ИсторияВызововAPI);

КонецПроцедуры

Процедура ОчиститьНезависимыйРегистрСведений(МенеджерРегистра)

	Попытка
		НаборЗаписей = МенеджерРегистра.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	Исключение
		Сообщить("Не удалось очистить регистр сведений. " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры


Процедура ОчиститьСправочники()

	УдалитьЭлементыСправочника(Справочники.Студенты);
	УдалитьЭлементыСправочника(Справочники.УчебныеГруппы);
	УдалитьЭлементыСправочника(Справочники.УчебныеПланы);
	УдалитьЭлементыСправочника(Справочники.Дисциплины);
	УдалитьЭлементыСправочника(Справочники.Преподаватели);
	УдалитьЭлементыСправочника(Справочники.Кафедры);
	УдалитьЭлементыСправочника(Справочники.НаправленияПодготовки);
	УдалитьЭлементыСправочника(Справочники.ФормыОбучения);
	УдалитьЭлементыСправочника(Справочники.Аудитории);
	УдалитьЭлементыСправочника(Справочники.ВидыЗанятий);
	УдалитьЭлементыСправочника(Справочники.ПричиныОтсутствия);
	УдалитьЭлементыСправочника(Справочники.ВнешниеСистемы);
	УдалитьЭлементыСправочника(Справочники.Подразделения);
	УдалитьЭлементыСправочника(Справочники.Организации);

КонецПроцедуры

Процедура УдалитьЭлементыСправочника(МенеджерСправочника)

	// Делаем несколько проходов, потому что у иерархических справочников
	// сначала должны удалиться элементы, а потом группы.
	Для ПопыткаУдаления = 1 По 5 Цикл
		
		Выборка = МенеджерСправочника.Выбрать();
		ЕстьОшибки = Ложь;
		
		Пока Выборка.Следующий() Цикл
			
			Попытка
				Объект = Выборка.ПолучитьОбъект();
				Объект.Удалить();
			Исключение
				ЕстьОшибки = Истина;
			КонецПопытки;
			
		КонецЦикла;
		
		Если НЕ ЕстьОшибки Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция НормализоватьКлюч(Значение)

	Возврат ВРег(СокрЛП(Строка(Значение)));

КонецФункции

Функция ПолучитьПолеСтрокиМакета(Данные, ИмяПоля, ЗначениеПоУмолчанию = "")

	ЗначениеПоля = ЗначениеПоУмолчанию;

	Если Данные.Свойство(ИмяПоля, ЗначениеПоля) Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;

	Возврат ЗначениеПоУмолчанию;

КонецФункции

Функция ПолучитьИзСоответствия(СоответствиеДанных, Ключ)

	Ключ = НормализоватьКлюч(Ключ);

	Если ПустаяСтрока(Ключ) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Значение = СоответствиеДанных.Получить(Ключ);

	Если Значение <> Неопределено Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ПолучитьСоответствиеСправочникаПоНаименованию(МенеджерСправочника)

	Результат = Новый Соответствие;

	Выборка = МенеджерСправочника.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Ключ = НормализоватьКлюч(Выборка.Наименование);
		
		Если НЕ ПустаяСтрока(Ключ) Тогда
			Результат.Вставить(Ключ, Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьСоответствиеНаправленийПодготовки()

	Результат = Новый Соответствие;

	Выборка = Справочники.НаправленияПодготовки.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		КлючНаименование = НормализоватьКлюч(Выборка.Наименование);
		
		Если НЕ ПустаяСтрока(КлючНаименование) Тогда
			Результат.Вставить(КлючНаименование, Выборка.Ссылка);
		КонецЕсли;
		
		КлючКод = НормализоватьКлюч(Выборка.КодНаправления);
		
		Если НЕ ПустаяСтрока(КлючКод) Тогда
			Результат.Вставить(КлючКод, Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьСоответствиеУчебныхГрупп()

	Результат = Новый Соответствие;

	Выборка = Справочники.УчебныеГруппы.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Ключ = НормализоватьКлюч(Выборка.Наименование);
		
		Если НЕ ПустаяСтрока(Ключ) Тогда
			Результат.Вставить(Ключ, Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьИлиСоздатьГруппуУчебныхГрупп(НаименованиеГруппы, СоответствиеУчебныхГрупп)

	НаименованиеГруппы = СокрЛП(Строка(НаименованиеГруппы));

	Если ПустаяСтрока(НаименованиеГруппы) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ключ = НормализоватьКлюч(НаименованиеГруппы);

	СуществующаяГруппа = СоответствиеУчебныхГрупп.Получить(Ключ);

	Если СуществующаяГруппа <> Неопределено Тогда
		Возврат СуществующаяГруппа;
	КонецЕсли;

	Группа = Справочники.УчебныеГруппы.СоздатьГруппу();
	Группа.Наименование = НаименованиеГруппы;
	Группа.Записать();

	СоответствиеУчебныхГрупп.Вставить(Ключ, Группа.Ссылка);

	Возврат Группа.Ссылка;

КонецФункции

Процедура ЗагрузитьДокументыИзМакета(Макет)

	ЗагрузитьПриказыОЗачисленииИзМакета(Макет);
	ЗагрузитьНазначенияПреподавателейИзМакета(Макет);
	ЗагрузитьФормированиеРасписанияИзМакета(Макет);
	ЗагрузитьЗанятияИзМакета(Макет);
	ЗагрузитьВедомостиОценокИзМакета(Макет);
	ЗагрузитьПосещенияЗанятийИзМакета(Макет);
//	ЗагрузитьОбращенияСтудентовИзМакета(Макет);

КонецПроцедуры

Процедура ЗагрузитьПриказыОЗачисленииИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ПриказОЗачислении");

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Организации = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Организации);
	УчебныеГруппы = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеГруппы);
	УчебныеПериоды = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеПериоды);
	Студенты = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Студенты);

	ДокументыПоИменам = Новый Соответствие;

	Для Каждого Данные Из Строки Цикл

		ИмяДокумента = ПолучитьПолеСтрокиМакета(Данные, "Документ");

		Если ПустаяСтрока(ИмяДокумента) Тогда
			Продолжить;
		КонецЕсли;

		КлючДокумента = НормализоватьКлюч(ИмяДокумента);
		Документ = ДокументыПоИменам.Получить(КлючДокумента);

		Если Документ = Неопределено Тогда

			Документ = Документы.ПриказОЗачислении.СоздатьДокумент();
			Документ.Дата = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "Дата"));

			Организация = ПолучитьИзСоответствия(Организации, ПолучитьПолеСтрокиМакета(Данные, "Организация"));
			УчебнаяГруппа = ПолучитьИзСоответствия(УчебныеГруппы, ПолучитьПолеСтрокиМакета(Данные, "УчебнаяГруппа"));
			УчебныйПериод = ПолучитьИзСоответствия(УчебныеПериоды, ПолучитьПолеСтрокиМакета(Данные, "УчебныйПериод"));

			Если ЗначениеЗаполнено(Организация) Тогда
				Документ.Организация = Организация;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
				Документ.УчебнаяГруппа = УчебнаяГруппа;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебныйПериод) Тогда
				Документ.УчебныйПериод = УчебныйПериод;
			КонецЕсли;

			Документ.Основание = ПолучитьПолеСтрокиМакета(Данные, "Основание");
			Документ.Ответственный = ПолучитьПолеСтрокиМакета(Данные, "Ответственный");

			ДокументыПоИменам.Вставить(КлючДокумента, Документ);

		КонецЕсли;

		Студент = ПолучитьИзСоответствия(Студенты, ПолучитьПолеСтрокиМакета(Данные, "Студент"));

		Если НЕ ЗначениеЗаполнено(Студент) Тогда
			Сообщить("Не найден студент для приказа о зачислении: " + ПолучитьПолеСтрокиМакета(Данные, "Студент"));
			Продолжить;
		КонецЕсли;

		СтрокаТЧ = Документ.Студенты.Добавить();
		СтрокаТЧ.Студент = Студент;
		СтрокаТЧ.НомерЗачетнойКнижки = ПолучитьПолеСтрокиМакета(Данные, "НомерЗачетнойКнижки");
		СтрокаТЧ.Комментарий = ПолучитьПолеСтрокиМакета(Данные, "Комментарий");

	КонецЦикла;

	Для Каждого Пара Из ДокументыПоИменам Цикл

		Попытка
			Пара.Значение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести приказ о зачислении: " + ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьНазначенияПреподавателейИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "НазначениеПреподавателя");

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Организации = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Организации);
	УчебныеПериоды = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеПериоды);
	УчебныеГруппы = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеГруппы);
	Дисциплины = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Дисциплины);
	Преподаватели = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Преподаватели);
	ВидыЗанятий = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.ВидыЗанятий);

	ДокументыПоИменам = Новый Соответствие;

	Для Каждого Данные Из Строки Цикл

		ИмяДокумента = ПолучитьПолеСтрокиМакета(Данные, "Документ");
		КлючДокумента = НормализоватьКлюч(ИмяДокумента);

		Документ = ДокументыПоИменам.Получить(КлючДокумента);

		Если Документ = Неопределено Тогда

			Документ = Документы.НазначениеПреподавателя.СоздатьДокумент();
			Документ.Дата = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "Дата"));

			Организация = ПолучитьИзСоответствия(Организации, ПолучитьПолеСтрокиМакета(Данные, "Организация"));
			УчебныйПериод = ПолучитьИзСоответствия(УчебныеПериоды, ПолучитьПолеСтрокиМакета(Данные, "УчебныйПериод"));

			Если ЗначениеЗаполнено(Организация) Тогда
				Документ.Организация = Организация;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебныйПериод) Тогда
				Документ.УчебныйПериод = УчебныйПериод;
			КонецЕсли;

			Документ.Ответственный = ПолучитьПолеСтрокиМакета(Данные, "Ответственный");
			Документ.Комментарий = ПолучитьПолеСтрокиМакета(Данные, "Комментарий");

			ДокументыПоИменам.Вставить(КлючДокумента, Документ);

		КонецЕсли;

		УчебнаяГруппа = ПолучитьИзСоответствия(УчебныеГруппы, ПолучитьПолеСтрокиМакета(Данные, "УчебнаяГруппа"));
		Дисциплина = ПолучитьИзСоответствия(Дисциплины, ПолучитьПолеСтрокиМакета(Данные, "Дисциплина"));
		Преподаватель = ПолучитьИзСоответствия(Преподаватели, ПолучитьПолеСтрокиМакета(Данные, "Преподаватель"));
		ВидЗанятия = ПолучитьИзСоответствия(ВидыЗанятий, ПолучитьПолеСтрокиМакета(Данные, "ВидЗанятия"));

		СтрокаТЧ = Документ.Назначения.Добавить();

		Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
			СтрокаТЧ.УчебнаяГруппа = УчебнаяГруппа;
		КонецЕсли;

		Если ЗначениеЗаполнено(Дисциплина) Тогда
			СтрокаТЧ.Дисциплина = Дисциплина;
		КонецЕсли;

		Если ЗначениеЗаполнено(Преподаватель) Тогда
			СтрокаТЧ.Преподаватель = Преподаватель;
		КонецЕсли;

		Если ЗначениеЗаполнено(ВидЗанятия) Тогда
			СтрокаТЧ.ВидЗанятия = ВидЗанятия;
		КонецЕсли;

		СтрокаТЧ.КоличествоЧасов = СтрокаВЧисло(ПолучитьПолеСтрокиМакета(Данные, "КоличествоЧасов"));

	КонецЦикла;

	Для Каждого Пара Из ДокументыПоИменам Цикл

		Попытка
			Пара.Значение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести назначение преподавателя: " + ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьЗанятияИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "Занятия");

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Организации = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Организации);
	УчебныеПериоды = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеПериоды);
	УчебныеГруппы = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеГруппы);
	Дисциплины = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Дисциплины);
	ВидыЗанятий = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.ВидыЗанятий);
	Преподаватели = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Преподаватели);
	Аудитории = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Аудитории);

	Для Каждого Данные Из Строки Цикл

		Документ = Документы.Занятие.СоздатьДокумент();
		Документ.Дата = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "Дата"));
		Документ.ДатаЗанятия = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "ДатаЗанятия"));

		Организация = ПолучитьИзСоответствия(Организации, ПолучитьПолеСтрокиМакета(Данные, "Организация"));
		УчебныйПериод = ПолучитьИзСоответствия(УчебныеПериоды, ПолучитьПолеСтрокиМакета(Данные, "УчебныйПериод"));
		УчебнаяГруппа = ПолучитьИзСоответствия(УчебныеГруппы, ПолучитьПолеСтрокиМакета(Данные, "УчебнаяГруппа"));
		Дисциплина = ПолучитьИзСоответствия(Дисциплины, ПолучитьПолеСтрокиМакета(Данные, "Дисциплина"));
		ВидЗанятия = ПолучитьИзСоответствия(ВидыЗанятий, ПолучитьПолеСтрокиМакета(Данные, "ВидЗанятия"));
		Преподаватель = ПолучитьИзСоответствия(Преподаватели, ПолучитьПолеСтрокиМакета(Данные, "Преподаватель"));
		Аудитория = ПолучитьИзСоответствия(Аудитории, ПолучитьПолеСтрокиМакета(Данные, "Аудитория"));

		Если ЗначениеЗаполнено(Организация) Тогда
			Документ.Организация = Организация;
		КонецЕсли;

		Если ЗначениеЗаполнено(УчебныйПериод) Тогда
			Документ.УчебныйПериод = УчебныйПериод;
		КонецЕсли;

		Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
			Документ.УчебнаяГруппа = УчебнаяГруппа;
		КонецЕсли;

		Если ЗначениеЗаполнено(Дисциплина) Тогда
			Документ.Дисциплина = Дисциплина;
		КонецЕсли;

		Если ЗначениеЗаполнено(ВидЗанятия) Тогда
			Документ.ВидЗанятия = ВидЗанятия;
		КонецЕсли;

		Если ЗначениеЗаполнено(Преподаватель) Тогда
			Документ.Преподаватель = Преподаватель;
		КонецЕсли;

		Если ЗначениеЗаполнено(Аудитория) Тогда
			Документ.Аудитория = Аудитория;
		КонецЕсли;

		Документ.КоличествоЧасов = СтрокаВЧисло(ПолучитьПолеСтрокиМакета(Данные, "КоличествоЧасов"));
		Документ.Состоялось = СтрокаВБулево(ПолучитьПолеСтрокиМакета(Данные, "Состоялось"));

		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести занятие: " + ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьВидОценки(ВидОценкиСтрокой)

	ВидОценкиСтрокой = НормализоватьКлюч(ВидОценкиСтрокой);

	Если ВидОценкиСтрокой = "ЗАЧЕТ" Тогда
		Возврат Перечисления.ВидыОценок.Зачет;
	КонецЕсли;

	Если ВидОценкиСтрокой = "КОНТРОЛЬНАЯ РАБОТА" Тогда
		Возврат Перечисления.ВидыОценок.КонтрольнаяРабота;
	КонецЕсли;

	Если ВидОценкиСтрокой = "ТЕСТ" Тогда
		Возврат Перечисления.ВидыОценок.Тест;
	КонецЕсли;

	Если ВидОценкиСтрокой = "ПРАКТИЧЕСКАЯ РАБОТА" Тогда
		Возврат Перечисления.ВидыОценок.ПрактическаяРабота;
	КонецЕсли;

	Возврат Перечисления.ВидыОценок.Экзамен;

КонецФункции

Процедура ЗагрузитьВедомостиОценокИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ВедомостьОценок");

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Организации = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Организации);
	УчебныеПериоды = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеПериоды);
	УчебныеГруппы = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеГруппы);
	Дисциплины = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Дисциплины);
	Преподаватели = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Преподаватели);
	Студенты = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Студенты);

	ДокументыПоИменам = Новый Соответствие;

	Для Каждого Данные Из Строки Цикл

		ИмяДокумента = ПолучитьПолеСтрокиМакета(Данные, "Документ");
		КлючДокумента = НормализоватьКлюч(ИмяДокумента);

		Документ = ДокументыПоИменам.Получить(КлючДокумента);

		Если Документ = Неопределено Тогда

			Документ = Документы.ВедомостьОценок.СоздатьДокумент();
			Документ.Дата = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "Дата"));

			Организация = ПолучитьИзСоответствия(Организации, ПолучитьПолеСтрокиМакета(Данные, "Организация"));
			УчебныйПериод = ПолучитьИзСоответствия(УчебныеПериоды, ПолучитьПолеСтрокиМакета(Данные, "УчебныйПериод"));
			УчебнаяГруппа = ПолучитьИзСоответствия(УчебныеГруппы, ПолучитьПолеСтрокиМакета(Данные, "УчебнаяГруппа"));
			Дисциплина = ПолучитьИзСоответствия(Дисциплины, ПолучитьПолеСтрокиМакета(Данные, "Дисциплина"));
			Преподаватель = ПолучитьИзСоответствия(Преподаватели, ПолучитьПолеСтрокиМакета(Данные, "Преподаватель"));

			Если ЗначениеЗаполнено(Организация) Тогда
				Документ.Организация = Организация;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебныйПериод) Тогда
				Документ.УчебныйПериод = УчебныйПериод;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
				Документ.УчебнаяГруппа = УчебнаяГруппа;
			КонецЕсли;

			Если ЗначениеЗаполнено(Дисциплина) Тогда
				Документ.Дисциплина = Дисциплина;
			КонецЕсли;

			Если ЗначениеЗаполнено(Преподаватель) Тогда
				Документ.Преподаватель = Преподаватель;
			КонецЕсли;

			Документ.ВидОценки = ПолучитьВидОценки(ПолучитьПолеСтрокиМакета(Данные, "ВидОценки"));
			Документ.ДатаОценивания = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "ДатаОценивания"));
			Документ.Ответственный = ПолучитьПолеСтрокиМакета(Данные, "Ответственный");

			ДокументыПоИменам.Вставить(КлючДокумента, Документ);

		КонецЕсли;

		Студент = ПолучитьИзСоответствия(Студенты, ПолучитьПолеСтрокиМакета(Данные, "Студент"));

		Если НЕ ЗначениеЗаполнено(Студент) Тогда
			Сообщить("Не найден студент для ведомости оценок: " + ПолучитьПолеСтрокиМакета(Данные, "Студент"));
			Продолжить;
		КонецЕсли;

		СтрокаТЧ = Документ.Оценки.Добавить();
		СтрокаТЧ.Студент = Студент;
		СтрокаТЧ.Балл = СтрокаВЧисло(ПолучитьПолеСтрокиМакета(Данные, "Балл"));
		СтрокаТЧ.ОценкаТекстом = ПолучитьПолеСтрокиМакета(Данные, "ОценкаТекстом");
		СтрокаТЧ.Комментарий = ПолучитьПолеСтрокиМакета(Данные, "Комментарий");

	КонецЦикла;

	Для Каждого Пара Из ДокументыПоИменам Цикл
		
		Попытка
			Пара.Значение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести ведомость оценок: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьВидПосещения(ВидПосещенияСтрокой)

	ВидПосещенияСтрокой = НормализоватьКлюч(ВидПосещенияСтрокой);

	Если ВидПосещенияСтрокой = "ОТСУТСТВОВАЛ" Тогда
		Возврат Перечисления.ВидыПосещения.Отсутствовал;
	КонецЕсли;

	Если ВидПосещенияСтрокой = "ОПОЗДАЛ" Тогда
		Возврат Перечисления.ВидыПосещения.Опоздал;
	КонецЕсли;

	Если ВидПосещенияСтрокой = "УВАЖИТЕЛЬНАЯ ПРИЧИНА" Тогда
		Возврат Перечисления.ВидыПосещения.УважительнаяПричина;
	КонецЕсли;

	Возврат Перечисления.ВидыПосещения.Присутствовал;

КонецФункции

Процедура ЗагрузитьПосещенияЗанятийИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ПосещениеЗанятия");

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Организации = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Организации);
	УчебныеПериоды = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеПериоды);
	УчебныеГруппы = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеГруппы);
	Дисциплины = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Дисциплины);
	Преподаватели = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Преподаватели);
	Студенты = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Студенты);
	ПричиныОтсутствия = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.ПричиныОтсутствия);

	ДокументыПоИменам = Новый Соответствие;

	Для Каждого Данные Из Строки Цикл

		ИмяДокумента = ПолучитьПолеСтрокиМакета(Данные, "Документ");
		КлючДокумента = НормализоватьКлюч(ИмяДокумента);

		Документ = ДокументыПоИменам.Получить(КлючДокумента);

		Если Документ = Неопределено Тогда

			Документ = Документы.ПосещениеЗанятия.СоздатьДокумент();
			Документ.Дата = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "Дата"));

			Организация = ПолучитьИзСоответствия(Организации, ПолучитьПолеСтрокиМакета(Данные, "Организация"));
			УчебныйПериод = ПолучитьИзСоответствия(УчебныеПериоды, ПолучитьПолеСтрокиМакета(Данные, "УчебныйПериод"));
			УчебнаяГруппа = ПолучитьИзСоответствия(УчебныеГруппы, ПолучитьПолеСтрокиМакета(Данные, "УчебнаяГруппа"));
			Дисциплина = ПолучитьИзСоответствия(Дисциплины, ПолучитьПолеСтрокиМакета(Данные, "Дисциплина"));
			Преподаватель = ПолучитьИзСоответствия(Преподаватели, ПолучитьПолеСтрокиМакета(Данные, "Преподаватель"));

			Если ЗначениеЗаполнено(Организация) Тогда
				Документ.Организация = Организация;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебныйПериод) Тогда
				Документ.УчебныйПериод = УчебныйПериод;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
				Документ.УчебнаяГруппа = УчебнаяГруппа;
			КонецЕсли;

			Если ЗначениеЗаполнено(Дисциплина) Тогда
				Документ.Дисциплина = Дисциплина;
			КонецЕсли;

			Если ЗначениеЗаполнено(Преподаватель) Тогда
				Документ.Преподаватель = Преподаватель;
			КонецЕсли;

			Документ.ДатаЗанятия = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "ДатаЗанятия"));

			ДокументыПоИменам.Вставить(КлючДокумента, Документ);

		КонецЕсли;

		Студент = ПолучитьИзСоответствия(Студенты, ПолучитьПолеСтрокиМакета(Данные, "Студент"));
		ПричинаОтсутствия = ПолучитьИзСоответствия(ПричиныОтсутствия, ПолучитьПолеСтрокиМакета(Данные, "ПричинаОтсутствия"));

		Если НЕ ЗначениеЗаполнено(Студент) Тогда
			Сообщить("Не найден студент для посещения занятия: " + ПолучитьПолеСтрокиМакета(Данные, "Студент"));
			Продолжить;
		КонецЕсли;

		СтрокаТЧ = Документ.Посещаемость.Добавить();
		СтрокаТЧ.Студент = Студент;
		СтрокаТЧ.ВидПосещения = ПолучитьВидПосещения(ПолучитьПолеСтрокиМакета(Данные, "ВидПосещения"));

		Если ЗначениеЗаполнено(ПричинаОтсутствия) Тогда
			СтрокаТЧ.ПричинаОтсутствия = ПричинаОтсутствия;
		КонецЕсли;

		СтрокаТЧ.Комментарий = ПолучитьПолеСтрокиМакета(Данные, "Комментарий");

	КонецЦикла;

	Для Каждого Пара Из ДокументыПоИменам Цикл
		
		Попытка
			Пара.Значение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести посещение занятия: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Функция СтрокаВремяВДату(ЗначениеСтрокой)

	ЗначениеСтрокой = СокрЛП(Строка(ЗначениеСтрокой));

	Если ПустаяСтрока(ЗначениеСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Ожидаемый формат: ЧЧ:ММ
	Часы = Число(Лев(ЗначениеСтрокой, 2));
	Минуты = Число(Сред(ЗначениеСтрокой, 4, 2));

	Возврат Дата(1, 1, 1, Часы, Минуты, 0);

КонецФункции

Процедура ЗагрузитьФормированиеРасписанияИзМакета(Макет)

	Строки = ПолучитьСтрокиРазделаМакета(Макет, "ФормированиеРасписания");

	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Организации = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Организации);
	УчебныеПериоды = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеПериоды);
	УчебныеГруппы = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.УчебныеГруппы);
	Дисциплины = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Дисциплины);
	ВидыЗанятий = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.ВидыЗанятий);
	Преподаватели = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Преподаватели);
	Аудитории = ПолучитьСоответствиеСправочникаПоНаименованию(Справочники.Аудитории);

	ДокументыПоИменам = Новый Соответствие;

	Для Каждого Данные Из Строки Цикл

		ИмяДокумента = ПолучитьПолеСтрокиМакета(Данные, "Документ");
		КлючДокумента = НормализоватьКлюч(ИмяДокумента);

		Если ПустаяСтрока(КлючДокумента) Тогда
			Продолжить;
		КонецЕсли;

		Документ = ДокументыПоИменам.Получить(КлючДокумента);

		Если Документ = Неопределено Тогда

			Документ = Документы.ФормированиеРасписания.СоздатьДокумент();
			Документ.Дата = СтрокаВДату(ПолучитьПолеСтрокиМакета(Данные, "Дата"));

			Организация = ПолучитьИзСоответствия(Организации, ПолучитьПолеСтрокиМакета(Данные, "Организация"));
			УчебныйПериод = ПолучитьИзСоответствия(УчебныеПериоды, ПолучитьПолеСтрокиМакета(Данные, "УчебныйПериод"));
			УчебнаяГруппа = ПолучитьИзСоответствия(УчебныеГруппы, ПолучитьПолеСтрокиМакета(Данные, "УчебнаяГруппа"));

			Если ЗначениеЗаполнено(Организация) Тогда
				Документ.Организация = Организация;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебныйПериод) Тогда
				Документ.УчебныйПериод = УчебныйПериод;
			КонецЕсли;

			Если ЗначениеЗаполнено(УчебнаяГруппа) Тогда
				Документ.УчебнаяГруппа = УчебнаяГруппа;
			КонецЕсли;

			Документ.Ответственный = ПолучитьПолеСтрокиМакета(Данные, "Ответственный");
			Документ.Комментарий = ПолучитьПолеСтрокиМакета(Данные, "Комментарий");

			ДокументыПоИменам.Вставить(КлючДокумента, Документ);

		КонецЕсли;

		Дисциплина = ПолучитьИзСоответствия(Дисциплины, ПолучитьПолеСтрокиМакета(Данные, "Дисциплина"));
		ВидЗанятия = ПолучитьИзСоответствия(ВидыЗанятий, ПолучитьПолеСтрокиМакета(Данные, "ВидЗанятия"));
		Преподаватель = ПолучитьИзСоответствия(Преподаватели, ПолучитьПолеСтрокиМакета(Данные, "Преподаватель"));
		Аудитория = ПолучитьИзСоответствия(Аудитории, ПолучитьПолеСтрокиМакета(Данные, "Аудитория"));

		СтрокаТЧ = Документ.Занятия.Добавить();
		СтрокаТЧ.ДеньНедели = СтрокаВЧисло(ПолучитьПолеСтрокиМакета(Данные, "ДеньНедели"));
		СтрокаТЧ.НомерПары = СтрокаВЧисло(ПолучитьПолеСтрокиМакета(Данные, "НомерПары"));
		СтрокаТЧ.ВремяНачала = СтрокаВремяВДату(ПолучитьПолеСтрокиМакета(Данные, "ВремяНачала"));
		СтрокаТЧ.ВремяОкончания = СтрокаВремяВДату(ПолучитьПолеСтрокиМакета(Данные, "ВремяОкончания"));

		Если ЗначениеЗаполнено(Дисциплина) Тогда
			СтрокаТЧ.Дисциплина = Дисциплина;
		КонецЕсли;

		Если ЗначениеЗаполнено(ВидЗанятия) Тогда
			СтрокаТЧ.ВидЗанятия = ВидЗанятия;
		КонецЕсли;

		Если ЗначениеЗаполнено(Преподаватель) Тогда
			СтрокаТЧ.Преподаватель = Преподаватель;
		КонецЕсли;

		Если ЗначениеЗаполнено(Аудитория) Тогда
			СтрокаТЧ.Аудитория = Аудитория;
		КонецЕсли;

	КонецЦикла;

	Для Каждого Пара Из ДокументыПоИменам Цикл

		Попытка
			Пара.Значение.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести формирование расписания: " + ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры
